***********************************************************************
***********************************************************************
**                                                                   **
**  0000000000000       11111111  11     000000000000  000000000000  **
**  0000     10000    111111111  1111    000021111111  000021111111  **
**  0000       000  11111         1111   0000          0000          **
**  0000      0000  1111           1111  0000          0000          **
**  0000000000000   111            1111  000000000     000000000     **
**  000000000000    111            1111  00000000      00000000      **
**  0000     0000   1111           1111  0000          0000          **
**  0000      0000  11111         1111   0000          0000          **
**  0000      0000    111111111111111    0000          0000          **
**  0000       0000     11111111111      0000          0000          **
**                                                                   **
***********************************************************************
***********************************************************************
* TIPO           : Executável
* CRIADO POR     : ROFF - Diogo Silva
* DATA           : 08/03/2016
* DESCRIÇÃO      : Entrada de Mercadoria de Produção
***********************************************************************
* ALTERAÇÃO      :
* DATA           :
* AUTOR          :
* DESCRIÇÃO      :
* PROCURAR <TAG> :
***********************************************************************
REPORT zwmfr0004 MESSAGE-ID zwmfr001.


INCLUDE zwmfr0004_d01.
INCLUDE zwmfr0004_d02.
INCLUDE zwmfr0004_f01.
INCLUDE zwmfr0004_o01.
INCLUDE zwmfr0004_i01.

INITIALIZATION.
  PERFORM initialization.

** Helps F4
************************************************************************
AT SELECTION-SCREEN ON VALUE-REQUEST FOR p_vhilm.
  PERFORM f4_vhilm CHANGING p_vhilm.

** Eventos
***********************************************************************
AT SELECTION-SCREEN OUTPUT.
  PERFORM selection_screen_pbo.

AT SELECTION-SCREEN.
  PERFORM selection_screen_pai.

START-OF-SELECTION.
  PERFORM start_of_selection.
